andrewleech/micropython/ports/stm32/fdcan.c
    const machine_pin_obj_t *pins[2];

    switch (can_id) {
        #if defined(MICROPY_HW_CAN1_TX)
        case PYB_CAN_1:
            can->Instance = FDCAN1;
            pins[0] = MICROPY_HW_CAN1_TX;
            pins[1] = MICROPY_HW_CAN1_RX;
            break;
        #endif

        #if defined(MICROPY_HW_CAN2_TX)
        case PYB_CAN_2:
            can->Instance = FDCAN2;
            pins[0] = MICROPY_HW_CAN2_TX;
            pins[1] = MICROPY_HW_CAN2_RX;
            break;
        #endif

        default:
            return false;
    }

    // Enable FDCAN clock
    __HAL_RCC_FDCAN_CLK_ENABLE();

    // init GPIO
    uint32_t pin_mode = MP_HAL_PIN_MODE_ALT;
    uint32_t pin_pull = MP_HAL_PIN_PULL_UP;
    for (int i = 0; i < 2; ++i) {
        if (!mp_hal_pin_config_alt(pins[i], pin_mode, pin_pull, AF_FN_CAN, can_id)) {
            return false;
        }
    }

    // initialise hardware, catching bad configuration errors.
    if (HAL_FDCAN_Init(can) != HAL_OK) {
        return false;
    }

    // Disable acceptance of non-matching frames (enabled by default)
    HAL_FDCAN_ConfigGlobalFilter(can, FDCAN_REJECT, FDCAN_REJECT, DISABLE, DISABLE);

    // The configuration registers are locked after CAN is started.
    if (HAL_FDCAN_Start(can) != HAL_OK) {
        return false;
    }

    // Reset all filters
    for (int f = 0; f < init->StdFiltersNbr; ++f) {
        can_clearfilter(can, f, false);
    }

    for (int f = 0; f < init->ExtFiltersNbr; ++f) {
        can_clearfilter(can, f, true);
    }

    switch (can_id) {
        case PYB_CAN_1:
            NVIC_SetPriority(FDCAN1_IT0_IRQn, IRQ_PRI_CAN);
            HAL_NVIC_EnableIRQ(FDCAN1_IT0_IRQn);
            NVIC_SetPriority(FDCAN1_IT1_IRQn, IRQ_PRI_CAN);
            HAL_NVIC_EnableIRQ(FDCAN1_IT1_IRQn);
            break;
        #if defined(MICROPY_HW_CAN2_TX)
        case PYB_CAN_2:
            NVIC_SetPriority(FDCAN2_IT0_IRQn, IRQ_PRI_CAN);
            HAL_NVIC_EnableIRQ(FDCAN2_IT0_IRQn);
            NVIC_SetPriority(FDCAN2_IT1_IRQn, IRQ_PRI_CAN);
            HAL_NVIC_EnableIRQ(FDCAN2_IT1_IRQn);
            break;
        #endif
        default:
            return false;
    }
    // FDCAN IT 0
    HAL_FDCAN_ConfigInterruptLines(can, FDCAN_IT_GROUP_RX_FIFO0 | FDCAN_IT_GROUP_BIT_LINE_ERROR | FDCAN_IT_GROUP_PROTOCOL_ERROR, FDCAN_INTERRUPT_LINE0);
    // FDCAN IT 1
    HAL_FDCAN_ConfigInterruptLines(can, FDCAN_IT_GROUP_RX_FIFO1, FDCAN_INTERRUPT_LINE1);

    // Enable error interrupts for all queue positions.
    // (RX-related interrupts are enabled via can_enable_rx_interrupts(),
    // and TX-related interrupts are enabled during TX
    HAL_FDCAN_ActivateNotification(can,
        FDCAN_IT_BUS_OFF | FDCAN_IT_ERROR_WARNING | FDCAN_IT_ERROR_PASSIVE, 0);
    return true;
}

void can_deinit(FDCAN_HandleTypeDef *can) {
    bool any_enabled = false;
    HAL_FDCAN_DeInit(can);

    if (can->Instance == FDCAN1) {
        HAL_NVIC_DisableIRQ(FDCAN1_IT0_IRQn);
        HAL_NVIC_DisableIRQ(FDCAN1_IT1_IRQn);
        #if defined(MICROPY_HW_CAN2_TX)
        any_enabled = NVIC_GetEnableIRQ(FDCAN2_IT0_IRQn);
        #endif
    #if defined(MICROPY_HW_CAN2_TX)
    } else if (can->Instance == FDCAN2) {
        HAL_NVIC_DisableIRQ(FDCAN2_IT0_IRQn);
        HAL_NVIC_DisableIRQ(FDCAN2_IT1_IRQn);
        any_enabled = NVIC_GetEnableIRQ(FDCAN1_IT0_IRQn);
    #endif
    }

    if (!any_enabled) {
        // Only reset FDCAN block and disable clock if all FDCAN units are disabled
        __HAL_RCC_FDCAN_FORCE_RESET();
        __HAL_RCC_FDCAN_RELEASE_RESET();
        __HAL_RCC_FDCAN_CLK_DISABLE();
    }
}

void can_clearfilter(FDCAN_HandleTypeDef *can, uint32_t f, bool is_extid) {
    FDCAN_FilterTypeDef filter = {
        .IdType = is_extid ? FDCAN_EXTENDED_ID : FDCAN_STANDARD_ID,
        .FilterIndex = f,
        .FilterConfig = FDCAN_FILTER_DISABLE,
    };
    HAL_FDCAN_ConfigFilter(can, &filter);
}

uint32_t can_get_source_freq(void) {
    // Find CAN kernel clock
    #if defined(STM32N6)
    return HAL_RCCEx_GetPeriphCLKFreq(RCC_PERIPHCLK_FDCAN);
    #elif defined(STM32H7)
    switch (__HAL_RCC_GET_FDCAN_SOURCE()) {
        case RCC_FDCANCLKSOURCE_HSE:
            return HSE_VALUE;
        case RCC_FDCANCLKSOURCE_PLL: {
            PLL1_ClocksTypeDef pll1_clocks;
            HAL_RCCEx_GetPLL1ClockFreq(&pll1_clocks);
            return pll1_clocks.PLL1_Q_Frequency;
        }
        case RCC_FDCANCLKSOURCE_PLL2: {
            PLL2_ClocksTypeDef pll2_clocks;
            HAL_RCCEx_GetPLL2ClockFreq(&pll2_clocks);
            return pll2_clocks.PLL2_Q_Frequency;
        }
        default:
            abort(); // Should be unreachable, macro should return one of the above
    }
    #elif defined(STM32G4) || defined(STM32H5)
    // STM32G4/H5 CAN clock from reset is HSE, unchanged by MicroPython
    return HSE_VALUE;
    #else // G0, and assume other MCUs too.
    // CAN1/CAN2/CAN3 on APB1 use GetPCLK1Freq, alternatively use the following:
    // can_kern_clk = ((HSE_VALUE / osc_config.PLL.PLLM ) * osc_config.PLL.PLLN) /
    //  (osc_config.PLL.PLLQ * clk_init.AHBCLKDivider * clk_init.APB1CLKDivider);
    return HAL_RCC_GetPCLK1Freq();
    #endif
}

void can_disable_rx_interrupts(CAN_HandleTypeDef *can, can_rx_fifo_t fifo) {
    HAL_FDCAN_DeactivateNotification(can, (fifo == CAN_RX_FIFO0) ? FDCAN_IT_RX_FIFO0_MASK : FDCAN_IT_RX_FIFO1_MASK);
}

void can_enable_rx_interrupts(CAN_HandleTypeDef *can, can_rx_fifo_t fifo, bool enable_msg_received) {
    uint32_t ints = (fifo == CAN_RX_FIFO0) ? FDCAN_IT_RX_FIFO0_MASK : FDCAN_IT_RX_FIFO1_MASK;
    if (!enable_msg_received) {
        ints &= FDCAN_IT_RX_NEW_MESSAGE_MASK;
    }
    HAL_FDCAN_ActivateNotification(can, ints, 0);
}

// Fixup the DataLength field from a byte count to a valid DLC value index (rounding up).
//
// The destination copy routine determines which of two encodings it expects: a bare
// DLC table index, or that index pre-shifted into the field position the DLC occupies
// in the message RAM header word (bits 19:16). Which encoding is needed does not
// depend on the MCU alone: on STM32H5, HAL_FDCAN_AddMessageToTxFifoQ() (used by
// can_transmit()) shifts internally and wants a bare index, while this port's own
// AddMessageToTxBuffer()/EnableTxBufferRequest() shim (used by can_transmit_buf_index(),
// shared verbatim with STM32G4) expects the value already shifted. Callers pass
// raw_dlc_index to select the encoding their destination routine needs.
static void encode_datalength(CanTxMsgTypeDef *txmsg, bool raw_dlc_index) {
    // Roundup DataLength to next DLC size and encode to DLC.
    size_t len_bytes = txmsg->DataLength;
    for (mp_uint_t i = 0; i < MP_ARRAY_SIZE(DLCtoBytes); i++) {
        if (len_bytes <= DLCtoBytes[i]) {
            txmsg->DataLength = raw_dlc_index ? i : (i << 16);
            return;
        }
    }
    assert(0); // DataLength value is invalid
}

