andrewleech/micropython/ports/stm32/fdcan.c
HAL_StatusTypeDef can_transmit(CAN_HandleTypeDef *can, CanTxMsgTypeDef *txmsg, uint8_t *data, uint32_t timeout_ms) {
    uint32_t start = HAL_GetTick();
    while (HAL_FDCAN_GetTxFifoFreeLevel(can) == 0) {
        if (timeout_ms == 0) {
            mp_raise_OSError(MP_ETIMEDOUT);
        }
        // Check for the Timeout
        if (timeout_ms != HAL_MAX_DELAY) {
            if (HAL_GetTick() - start >= timeout_ms) {
                mp_raise_OSError(MP_ETIMEDOUT);
            }
        }
        mp_event_wait_ms(1);
    }
    // Note: this function doesn't set up TX interrupts, because it's only used by pyb.CAN which
    // doesn't care about this - machine.CAN calls can_transmit_buf_index()
    //
    // HAL_FDCAN_AddMessageToTxFifoQ() below is the real HAL implementation on every supported
    // MCU. It expects a bare DLC index on STM32N6 and STM32H5, and that index pre-shifted into
    // the header word on STM32G4 and STM32H7.
    #if defined(STM32N6) || defined(STM32H5)
    encode_datalength(txmsg, true);
    #else
    encode_datalength(txmsg, false);
    #endif

    return HAL_FDCAN_AddMessageToTxFifoQ(can, txmsg, data);
}

HAL_StatusTypeDef can_transmit_buf_index(CAN_HandleTypeDef *hcan, int index, CanTxMsgTypeDef *txmsg, const uint8_t *data) {
    uint32_t tx_loc = 1U << index;

    // HAL_FDCAN_AddMessageToTxBuffer() below is this port's own shim on STM32G4 and STM32H5
    // (see the definition further down this file), which expects the DLC index pre-shifted
    // into the header word. On STM32H7 and STM32N6 it resolves to the real HAL implementation,
    // which expects a bare index on STM32N6 and that index pre-shifted on STM32H7.
    #if defined(STM32N6)
    encode_datalength(txmsg, true);
    #else
    encode_datalength(txmsg, false);
    #endif

    HAL_StatusTypeDef err = HAL_FDCAN_ActivateNotification(hcan, FDCAN_IT_TX_COMPLETE | FDCAN_IT_TX_ABORT_COMPLETE, tx_loc);
    if (err == HAL_OK) {
        // Note: casting away const from data, the HAL implementation still treats 'data' as const
        err = HAL_FDCAN_AddMessageToTxBuffer(hcan, txmsg, (void *)data, tx_loc);
    }
    if (err == HAL_OK) {
        err = HAL_FDCAN_EnableTxBufferRequest(hcan, tx_loc);
    }
    return err;
}

bool can_cancel_transmit(CAN_HandleTypeDef *hcan, int index) {
    FDCAN_GlobalTypeDef *instance = hcan->Instance;
    bool result = false;

    if (instance->TXBRP & (1U << index)) {
        result = true;
        HAL_StatusTypeDef err = HAL_FDCAN_AbortTxRequest(hcan, 1U << index);
        assert(err == HAL_OK); // Should only fail if controller not started
        if (err != HAL_OK) {
            return false;
        }
        mp_uint_t start = mp_hal_ticks_us();

        // Wait for the TX buffer to be marked as no longer pending
        while ((instance->TXBRP & (1U << index)) != 0) {
            // we don't expect this to take longer than a few clock cycles, if
            // it does then it probably indicates a bug in the driver. However,
            // either way we don't want to end up stuck here
            mp_uint_t elapsed = mp_hal_ticks_us() - start;
            assert(elapsed < 1000);
            if (elapsed >= 1000) {
                break;
            }
        }
    }

    return result;
}

int can_receive(FDCAN_HandleTypeDef *can, can_rx_fifo_t fifo, FDCAN_RxHeaderTypeDef *hdr, uint8_t *data, uint32_t timeout_ms) {
    volatile uint32_t *rxf, *rxa;
    uint32_t fl;

    if (fifo == CAN_RX_FIFO0) {
        rxf = &can->Instance->RXF0S;
        rxa = &can->Instance->RXF0A;
        fl = FDCAN_RXF0S_F0FL;
    } else {
        rxf = &can->Instance->RXF1S;
        rxa = &can->Instance->RXF1A;
        fl = FDCAN_RXF1S_F1FL;
    }

    // Wait for a message to become available, with timeout
    uint32_t start = HAL_GetTick();
    while ((*rxf & fl) == 0) {
        if (timeout_ms != HAL_MAX_DELAY) {
            if (HAL_GetTick() - start >= timeout_ms) {
                return -MP_ETIMEDOUT;
            }
        }
        mp_event_wait_ms(1);
    }

    // Get pointer to incoming message
    uint32_t index, *address;
    if (fifo == CAN_RX_FIFO0) {
        index = (*rxf & FDCAN_RXF0S_F0GI) >> FDCAN_RXF0S_F0GI_Pos;
        // G0's FDCAN_InitTypeDef has no RxFifo0ElmtSize field either, the
        // same fixed 18-word element the comment already names for G4/H5.
        #if defined(STM32G4) || defined(STM32H5) || defined(STM32G0)
        address = (uint32_t *)(can->msgRam.RxFIFO0SA + (index * (18U * 4U)));  // SRAMCAN_RF0_SIZE bytes, size not configurable
        #else
        address = (uint32_t *)(can->msgRam.RxFIFO0SA + (index * can->Init.RxFifo0ElmtSize * 4));
        #endif
    } else {
        index = (*rxf & FDCAN_RXF1S_F1GI) >> FDCAN_RXF1S_F1GI_Pos;
        #if defined(STM32G4) || defined(STM32H5) || defined(STM32G0)
        address = (uint32_t *)(can->msgRam.RxFIFO1SA + (index * (18U * 4U)));  // SRAMCAN_RF1_SIZE bytes, size not configurable
        #else
        address = (uint32_t *)(can->msgRam.RxFIFO1SA + (index * can->Init.RxFifo1ElmtSize * 4));
        #endif
    }

    // Parse header of message
    hdr->IdType = *address & FDCAN_ELEMENT_MASK_XTD;
    if (hdr->IdType == FDCAN_STANDARD_ID) {
        hdr->Identifier = (*address & FDCAN_ELEMENT_MASK_STDID) >> 18;
    } else {
        hdr->Identifier = *address & FDCAN_ELEMENT_MASK_EXTID;
    }
    hdr->RxFrameType = *address & FDCAN_ELEMENT_MASK_RTR;
    hdr->ErrorStateIndicator = *address++ & FDCAN_ELEMENT_MASK_ESI;
    hdr->RxTimestamp = *address & FDCAN_ELEMENT_MASK_TS;
    hdr->DataLength = (*address & FDCAN_ELEMENT_MASK_DLC) >> 16;
    hdr->BitRateSwitch = *address & FDCAN_ELEMENT_MASK_BRS;
    hdr->FDFormat = *address & FDCAN_ELEMENT_MASK_FDF;
    hdr->FilterIndex = (*address & FDCAN_ELEMENT_MASK_FIDX) >> 24;
    hdr->IsFilterMatchingFrame = (*address++ & FDCAN_ELEMENT_MASK_ANMF) >> 31;
    // Convert DLC to Bytes.
    hdr->DataLength = DLCtoBytes[hdr->DataLength];

    // Copy data
    uint8_t *pdata = (uint8_t *)address;
    for (uint32_t i = 0; i < hdr->DataLength; ++i) {
        *data++ = *pdata++;
    }

