andrewleech/micropython/ports/stm32/fdcan.c
    // Release (free) message from FIFO
    *rxa = index;

    return 0; // success
}

can_state_t can_get_state(CAN_HandleTypeDef *can) {
    uint32_t psr;

    if (can->State != HAL_FDCAN_STATE_BUSY) {
        // The HAL states which map to "stopped" are:
        // HAL_FDCAN_STATE_RESET - peripheral never initialised
        // HAL_FDCAN_STATE_READY - CAN is stopped (i.e. HAL_FDCAN_CAN_Stop() called)
        // HAL_FDCAN_STATE_ERROR - Internal transition timeout, mostly relates to
        //                         low-power states we currently don't use
        return CAN_STATE_STOPPED;
    }

    psr = can->Instance->PSR;
    if (psr & FDCAN_PSR_BO) {
        return CAN_STATE_BUS_OFF;
    } else if (psr & FDCAN_PSR_EP) {
        return CAN_STATE_ERROR_PASSIVE;
    } else if (psr & FDCAN_PSR_EW) {
        return CAN_STATE_ERROR_WARNING;
    } else {
        return CAN_STATE_ERROR_ACTIVE;
    }
}

void can_get_counters(CAN_HandleTypeDef *can, can_counters_t *counters) {
    FDCAN_GlobalTypeDef *inst = can->Instance;
    uint32_t esr = inst->ECR;
    counters->tec = (esr & FDCAN_ECR_TEC_Msk) >> FDCAN_ECR_TEC_Pos;
    if (esr & FDCAN_ECR_RP) {
        counters->rec = 128; // "at least 128"
    } else {
        counters->rec = (esr & FDCAN_ECR_REC_Msk) >> FDCAN_ECR_REC_Pos;
    }
    if (can->Init.TxFifoQueueMode == FDCAN_TX_FIFO_OPERATION) {
        counters->tx_pending = inst->TXEFS & 0x7;
    } else {
        counters->tx_pending = mp_popcount(inst->TXBRP);
    }
    counters->rx_fifo0_pending = (inst->RXF0S & FDCAN_RXF0S_F0FL_Msk) >> FDCAN_RXF0S_F0FL_Pos;
    counters->rx_fifo1_pending = (inst->RXF1S & FDCAN_RXF1S_F1FL_Msk) >> FDCAN_RXF1S_F1FL_Pos;
}

void can_disable_tx_interrupts(CAN_HandleTypeDef *can) {
    HAL_FDCAN_DeactivateNotification(can, FDCAN_IT_TX_COMPLETE | FDCAN_IT_TX_ABORT_COMPLETE);
}

void can_restart(CAN_HandleTypeDef *can) {
    HAL_FDCAN_Stop(can);
    HAL_FDCAN_Start(can);
}

// Compatibility shim: call both the pyb.CAN and machine.CAN handlers if necessary,
// allow them to decide which is initialised.
static inline void call_can_irq_handler(uint can_id, can_int_t interrupt, can_rx_fifo_t fifo) {
    #if MICROPY_PY_MACHINE_CAN
    machine_can_irq_handler(can_id, interrupt);
    #endif
    if (interrupt != CAN_INT_TX_COMPLETE) {
        pyb_can_irq_handler(can_id, interrupt, fifo);
    }
    // TODO: Need to do something to clear the transmit state if pyb.CAN is in use, I think
    // (check usage of can_get_transmit_finished() from pyb CAN code)
}

static void can_irq_handler(uint can_id, CAN_TypeDef *instance, can_rx_fifo_t fifo) {
    uint32_t ints, rx_fifo_ints, error_ints, tx_complete_int;

    ints = instance->IR & instance->IE;

    if (fifo == CAN_RX_FIFO0) {
        rx_fifo_ints = ints & FDCAN_IT_RX_FIFO0_MASK;
    } else {
        rx_fifo_ints = ints & FDCAN_IT_RX_FIFO1_MASK;
    }
    error_ints = ints & FDCAN_IT_ERROR_STATUS_MASK;

    tx_complete_int = ints & (FDCAN_IT_TX_COMPLETE | FDCAN_IT_TX_ABORT_COMPLETE);

    // Disable receive interrupts, re-enabled by higher layer after calling can_receive()

    // (Note: can't use __HAL_CAN API as only have a CAN_TypeDef, not CAN_HandleTypeDef)
    instance->IE &= ~rx_fifo_ints;
    instance->IR = rx_fifo_ints | error_ints | tx_complete_int;

    if (rx_fifo_ints) {
        if (rx_fifo_ints & FDCAN_IT_RX_FULL_MASK) {
            call_can_irq_handler(can_id, CAN_INT_FIFO_FULL, fifo);
        }
        if (rx_fifo_ints & FDCAN_IT_RX_MESSAGE_LOST_MASK) {
            call_can_irq_handler(can_id, CAN_INT_FIFO_OVERFLOW, fifo);
        }
        if (rx_fifo_ints & FDCAN_IT_RX_NEW_MESSAGE_MASK) {
            call_can_irq_handler(can_id, CAN_INT_MESSAGE_RECEIVED, fifo);
        }
    }

    if (error_ints) {
        uint32_t Psr = instance->PSR;

        if (error_ints & (FDCAN_IT_ERROR_WARNING | FDCAN_IT_ERROR_PASSIVE | FDCAN_IT_BUS_OFF)) {
            if (Psr & FDCAN_PSR_BO) {
                call_can_irq_handler(can_id, CAN_INT_ERR_BUS_OFF, 0);
            } else if (Psr & FDCAN_PSR_EP) {
                call_can_irq_handler(can_id, CAN_INT_ERR_PASSIVE, 0);
            } else if (Psr & FDCAN_PSR_EW) {
                call_can_irq_handler(can_id, CAN_INT_ERR_WARNING, 0);
            }
        }
    }

    if (tx_complete_int) {
        // Disable TX interrupts until we process these ones
        instance->IE &= ~tx_complete_int;
        call_can_irq_handler(can_id, CAN_INT_TX_COMPLETE, 0);
    }
}

#if defined(MICROPY_HW_CAN1_TX)
void FDCAN1_IT0_IRQHandler(void) {
    IRQ_ENTER(FDCAN1_IT0_IRQn);
    can_irq_handler(PYB_CAN_1, FDCAN1, CAN_RX_FIFO0);
    IRQ_EXIT(FDCAN1_IT0_IRQn);
}

void FDCAN1_IT1_IRQHandler(void) {
    IRQ_ENTER(FDCAN1_IT1_IRQn);
    can_irq_handler(PYB_CAN_1, FDCAN1, CAN_RX_FIFO1);
    IRQ_EXIT(FDCAN1_IT1_IRQn);
}
#endif

#if defined(MICROPY_HW_CAN2_TX)
void FDCAN2_IT0_IRQHandler(void) {
    IRQ_ENTER(FDCAN2_IT0_IRQn);
    can_irq_handler(PYB_CAN_2, FDCAN2, CAN_RX_FIFO0);
    IRQ_EXIT(FDCAN2_IT0_IRQn);
}

void FDCAN2_IT1_IRQHandler(void) {
    IRQ_ENTER(FDCAN2_IT1_IRQn);
    can_irq_handler(PYB_CAN_2, FDCAN2, CAN_RX_FIFO1);
    IRQ_EXIT(FDCAN2_IT1_IRQn);
}
#endif

#if defined(STM32G4) || defined(STM32H5)
// These implementations are copied from stm32h7xx_hal_fdcan.c with modifications for different G4 registers & code formatting

// *FORMAT-OFF*
// ^^^ Keep original STM HAL code style for easier comparison

static void FDCAN_CopyMessageToRAM(FDCAN_HandleTypeDef *hfdcan, FDCAN_TxHeaderTypeDef *pTxHeader, uint8_t *pTxData, uint32_t BufferIndex);

static HAL_StatusTypeDef HAL_FDCAN_AddMessageToTxBuffer(FDCAN_HandleTypeDef *hfdcan, FDCAN_TxHeaderTypeDef *pTxHeader, uint8_t *pTxData, uint32_t BufferIndex)
{
  HAL_FDCAN_StateTypeDef state = hfdcan->State;

  /* Check function parameters */
  assert_param(IS_FDCAN_ID_TYPE(pTxHeader->IdType));
  if (pTxHeader->IdType == FDCAN_STANDARD_ID)
  {
    assert_param(IS_FDCAN_MAX_VALUE(pTxHeader->Identifier, 0x7FFU));
  }
  else /* pTxHeader->IdType == FDCAN_EXTENDED_ID */
  {
    assert_param(IS_FDCAN_MAX_VALUE(pTxHeader->Identifier, 0x1FFFFFFFU));
  }
  assert_param(IS_FDCAN_FRAME_TYPE(pTxHeader->TxFrameType));
  assert_param(IS_FDCAN_DLC(pTxHeader->DataLength));
  assert_param(IS_FDCAN_ESI(pTxHeader->ErrorStateIndicator));
  assert_param(IS_FDCAN_BRS(pTxHeader->BitRateSwitch));
  assert_param(IS_FDCAN_FDF(pTxHeader->FDFormat));
  assert_param(IS_FDCAN_EFC(pTxHeader->TxEventFifoControl));
  assert_param(IS_FDCAN_MAX_VALUE(pTxHeader->MessageMarker, 0xFFU));
  assert_param(IS_FDCAN_TX_LOCATION(BufferIndex));

  if ((state == HAL_FDCAN_STATE_READY) || (state == HAL_FDCAN_STATE_BUSY))
  {
    /* Check that the selected buffer has an allocated area into the RAM */
    if (POSITION_VAL(BufferIndex) >= CAN_TX_QUEUE_LEN) // Note: Modified for G4 here
    {
      /* Update error code */
      hfdcan->ErrorCode |= HAL_FDCAN_ERROR_PARAM;

      return HAL_ERROR;
    }

